In [ ]:
#Basic python

# Basic python

In [2]:
A=6

In [3]:
A

6

In [5]:
a='10'
a

'10'

In [9]:
b=int(input())
b

 12

12

In [10]:
a=[]
a

[]

In [11]:
for i in range(0,10):
    a.append(i)

In [12]:
a

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9]

In [24]:
arr = []
n = input("Enter the number of string elements: ",)

for i in range(n):
    element = input("Enter a string: ",)
    arr.append(element)

print("Array of strings:", arr)

Enter the number of string elements:  shaik

TypeError: 'str' object cannot be interpreted as an integer

In [16]:
names, ids, cgs = [], [], []

for i in range(3):
    a = input("Enter a name: ")
    names.append(a)
    
    a = input("Enter an id: ")
    ids.append(a)
    
    a = input("Enter a CGPA: ")
    cgs.append(a)

print("Names:", names)
print("IDs:", ids)
print("CGPAs:", cgs)

Enter a name:  sjaol
Enter an id:  34
Enter a CGPA:  6.33
Enter a name:  abdul
Enter an id:  45
Enter a CGPA:  3.22
Enter a name:  ahad
Enter an id:  89
Enter a CGPA:  4.66

Names: ['sjaol', 'abdul', 'ahad']
IDs: ['34', '45', '89']
CGPAs: ['6.33', '3.22', '4.66']

In [18]:
dict={'Name':names,'ID':ids,'CGPA':cgs}
dict

{'Name': ['sjaol', 'abdul', 'ahad'],
 'ID': ['34', '45', '89'],
 'CGPA': ['6.33', '3.22', '4.66']}

In [21]:
import pandas as pd

In [22]:
df=pd.DataFrame(data=dict)
df

    Name  ID  CGPA
0  sjaol  34  6.33
1  abdul  45  3.22
2   ahad  89  4.66

In [23]:
df.to_csv('Testdata.csv')

In [25]:
import random

In [26]:
x=random.randint(25,30)
x

27

In [35]:
df

    Name  ID  CGPA
0  sjaol  34  6.33
1  abdul  45  3.22
2   ahad  89  4.66

In [36]:
age=[]
for i in range(0,3):
    x = random.randint(25,30) 
    age.append(x)
age

[27, 25, 25]

In [37]:
df

    Name  ID  CGPA
0  sjaol  34  6.33
1  abdul  45  3.22
2   ahad  89  4.66

In [38]:
df["AGE"] = age
df

    Name  ID  CGPA  AGE
0  sjaol  34  6.33   27
1  abdul  45  3.22   25
2   ahad  89  4.66   25

In [76]:
age,hemoglobin,tg,cholestro=[],[],[],[]

for i in range(10):
    x = random.randint(25,30) 
    age.append(x)
    a =random.uniform(10,18)
    hemoglobin.append(a)
    a = random.uniform(5,40)
    tg.append(a)
    a = random.uniform(10,60)
    cholestro.append(a)

In [67]:
hemoglobin

[(11.926475927945287, 2),
 (16.954310043638575, 2),
 (11.634577073797473, 2),
 (17.83763079710879, 2),
 (17.060469439125665, 2),
 (14.444378736014716, 2),
 (17.468263406086585, 2),
 (12.108470350071347, 2),
 (16.955475574896028, 2),
 (12.985720524888292, 2)]

In [68]:
dict={'AGE':age,'Hemoglobin':hemoglobin,'TG':tg,'Cholestro':cholestro}
dict

{'AGE': [28, 27, 27, 30, 27, 26, 29, 26, 25, 28],
 'Hemoglobin': [(11.926475927945287, 2),
  (16.954310043638575, 2),
  (11.634577073797473, 2),
  (17.83763079710879, 2),
  (17.060469439125665, 2),
  (14.444378736014716, 2),
  (17.468263406086585, 2),
  (12.108470350071347, 2),
  (16.955475574896028, 2),
  (12.985720524888292, 2)],
 'TG': [16.423497618681928,
  8.62215932198527,
  26.9258437828334,
  19.774321025830943,
  32.89316253682252,
  18.605101881348265,
  22.240300674171902,
  12.359029977564694,
  9.012955337833954,
  7.4986240336143535],
 'Cholestro': [58.785714721124265,
  49.25148223199324,
  46.86035143880868,
  48.526808646769375,
  36.114842406742724,
  13.978866353566579,
  23.21853827966684,
  12.056345697160877,
  23.75811936130121,
  24.532986680569405]}

In [63]:
import pandas as pd

In [69]:
df=pd.DataFrame(data=dict)
df

   AGE               Hemoglobin         TG  Cholestro
0   28  (11.926475927945287, 2)  16.423498  58.785715
1   27  (16.954310043638575, 2)   8.622159  49.251482
2   27  (11.634577073797473, 2)  26.925844  46.860351
3   30   (17.83763079710879, 2)  19.774321  48.526809
4   27  (17.060469439125665, 2)  32.893163  36.114842
5   26  (14.444378736014716, 2)  18.605102  13.978866
6   29  (17.468263406086585, 2)  22.240301  23.218538
7   26  (12.108470350071347, 2)  12.359030  12.056346
8   25  (16.955475574896028, 2)   9.012955  23.758119
9   28  (12.985720524888292, 2)   7.498624  24.532987

In [73]:
x = round(random.random(),2)

In [74]:
x

0.51

In [79]:
df=pd.DataFrame(data=dict)
df

   AGE               Hemoglobin         TG  Cholestro
0   28  (11.926475927945287, 2)  16.423498  58.785715
1   27  (16.954310043638575, 2)   8.622159  49.251482
2   27  (11.634577073797473, 2)  26.925844  46.860351
3   30   (17.83763079710879, 2)  19.774321  48.526809
4   27  (17.060469439125665, 2)  32.893163  36.114842
5   26  (14.444378736014716, 2)  18.605102  13.978866
6   29  (17.468263406086585, 2)  22.240301  23.218538
7   26  (12.108470350071347, 2)  12.359030  12.056346
8   25  (16.955475574896028, 2)   9.012955  23.758119
9   28  (12.985720524888292, 2)   7.498624  24.532987